[
  {
    "id": "1",
    "type": "Announcement",
    "title": "Hashed And Icetea Labs Join Forces Towards A Common Goal In GameFi And Metaverse",
    "date": "FRI 02/11",
    "image": "news/hashed.png",
    "hashtags": [],
    "intro": "Hashed and Icetea Labs, as strategic partners, will co-build a self-sustainable, interoperable, open metaverse and GameFi ecosystem in the long run.",
    "content": [
      "Since the latter half of 2021, GameFi and metaverse have driven the crypto market; henceforth, a dozen of crypto games have launched per month and led to a wider selection of games that users can choose from. But as one delves deeper into this space, crypto games are actually facing hardships in implementing a sustainable in-game economy. Simultaneously, even emerging metaverses are extant only on trailers, casting doubt on the wide discrepancy between vision and reality. The market is starting to see faltering games with a short-term focus and an unsustainable in-game economy.",
      "Sharing a common vision and understanding of the potentials for and challenges to the future of GameFi and metaverse, Hashed and Icetea Labs shook hands to form a strategic partnership without termination dates.",
      "To be specific, the two strategic partners will explore the details to cooperate closely in an on-hands manner in GameFi and metaverse with regard to R&D and financing, ranging from infrastructure layers, platforms, and services, to interoperable flagship products, supporting the full lifecycle of games and metaverses (i.e. tokenomics design, launch plan, marketing, and etc.).",
      "The strategic collaboration is expected to fuel the overall growth of the gaming and metaverse industry, especially in the Asia Pacific.",
      "Jun Park, Investment Associate at Hashed focusing on crypto investments through the eyes of gaming: “In reality, the number of crypto games that are officially launched with meaningful daily active users is low. I have noticed faltering projects which were not able to converge their vision and reality at the end of the day. From 2022 along with Icetea Labs, I hope to see and will actively search for genuine GameFi projects with the following, non-exhaustive traits: 1) fair game mechanics; 2) play-to-earn through time-based efforts; 3) circular economy with low treasury intervention; 4) gaming fundamentals being fun at its core.”",
      "Edward Hong, Head of Growth at Hashed: “SEA (Southeast Asia) is the region with the fastest-growing adoption of blockchain games and GameFi. It is mesmerizing that blockchain games like Axie Infinity are now entirely transforming the economic patterns of people living in the region. Through this partnership, Hashed will work closely with Icetea Labs in the region to actively discover founders and support them to create a new value.”",
      "Thi Truong, founder of Icetea Labs: \"Blockchain gaming and metaverse industry suffer if companies just want to take away from it rather than contributing. There are many missing pieces and supporting systems that need to be built seriously and with a long-term vision in mind. In 2022 and the years to come, Icetea Labs devotes itself to research and experiments of sustainable economic models, designing cross-game and cross-metaverse mechanisms, building workforce and inhabitants for metaverses, and collaborating on infrastructure effort. We are very happy to work together with Hashed, one of the most visionary leaders in crypto space, on this journey.\"",
      "Hashed is an early-stage venture firm focused on blockchain protocols. Led by serial entrepreneurs and engineers, Hashed focuses on expediting global blockchain adoption through strategic investments and community building. Based in South Korea, San Francisco, Singapore and Bangalore, Hashed has cultivated industry-defining web3 founders around the globe by accelerating protocols such as Terra Money, Axie Infinity, Klaytn, Link, and The Sandbox. Hashed additionally operates metaverse studio UNOPND and Korean cryptocurrency custodian KODA.",
      "Icetea Labs is a notable gaming and metaverse incubator and enabler in Asia - the world's most exciting blockchain gaming and metaverse community. Operating two of the best performing launchpads, GameFi.org and Red Kite, Icetea Labs has advised, strategically invested, and launched many high profile games and metaverses such as Bloktopia, Sidus, Solice, etc. Icetea Labs also owns Mirai game studio, and is working closely with several industry-leading partners on critical gaming and metaverse initiatives."
    ],
    "tags": [
      "Infrastructure",
      "Partnership"
    ]
  }
]