[
  {
    "id": "1",
    "type": "Announcement",
    "title": "Introducing the Icetea Labs accelerator program",
    "date": "Mon 15/08",
    "image": "https://i.imgur.com/NiiZ4aN.png",
    "hashtags": [],
    "short_intro": "Web3 leading incubator Icetea Labs has announced the creation of its inaugural Web3 Accelerator Program in conjunction with Polygon and Alpha Venture DAO.",
    "intro": "INTRODUCING THE ICETEA LABS ACCELERATOR PROGRAM",
    "html": true,
    "content": [
      "<b>1. WHAT IS THE ICETEA LABS ACCELERATOR PROGRAM?</b>",
      "<b>Icetea Labs Accelerator Program (ILAP)</b> is the 08-week accelerator program that helps Web3 Startups in product/market fit, expansion, and growth. Our focus for this cohort is GameFi, Metaverse, NFT utilities and beyond.",
      "ILAP is powered by Icetea Labs and co-organized with <a href=\"https://polygon.technology/\" target=\"_blank\" rel=\"noreferrer noopener\">Polygon</a>, one of the top blockchain development platforms offering scalable and sustainable blockchains and Alpha Venture DAO, the leading Web3 venture builder and incubator in Southeast Asia.",
      "The Icetea Labs Accelerator Program has the participation of several high-profile partners, funds and mentors including Polygon, <a href=\"https://alphaventuredao.io/\" target=\"_blank\" rel=\"noreferrer noopener\">Alpha Venture DAO</a>, Hashed, Protocol Labs, Global Founders Capital (GFC), Polygon Studios, Saison Capital, Crypto.com Capital, Shima Capital, CyberAgent Capital, Filecoin, Amazon Web Services (AWS), Bybit, GameFi.org, DAO Maker, Avocado DAO, Salad Ventures, Funtap, Red Kite launchpad, Certik, DESports.gg, Symbolic Capital, Spark Digital Capital, Moonrock Capital, iCandy Interactive, Topebox, Dvision Network, BitKeep, Alpha Lab Capital and many others.",
      "The program is also accompanied by several well-known media partners including CoinMarketCap, Momentum6, Crypto Banter, AltcoinBuzz, Cryptodiffer, Satoshi Club, Top 7 ICO, Vendetta Ventures, and HG Ventures.",
      "<b>2. WHO SHOULD JOIN ILAP?</b>",
      "ILAP is open for any Web3 Startup whose product or service relates to gaming, metaverse, or NFT utilities. Startups at all stages benefit from the contents of ILAP. Early product startups with MVP will benefit the most that we can help with project audit, ecosystem network, security, business model, and go-to-market strategy. While the later stages project will enjoy advice mostly on marketing, community building, traction growth, funding, and tokenomics.",
      "It doesn’t matter where you come from. What world you’re building that counts.",
      "<b>3. BENEFITS FOR WEB3 STARTUPS JOINING ILAP</b>",
      "Web3 Startups who are selected to join the Accelerator program will receive a lot of attractive benefits:",
      "<b>- Expertise</b>: Accessible to in-depth knowledge, mentors, experts, and global investors in Web3 Business.",
      "<b>- Ecosystem</b>: Accessible to an entire ecosystem of Icetea Labs and its partners that supports a full product development and operation lifecycle.",
      "<b>- Investment</b>: Funding opportunities on showcase day where participating startups pitch to accredited venture capital investors, angels, entrepreneurs, mentors, and partners.",
      "The advantage is not limited to the program course only. Graduated startups will have access to Icetea Lab’s Alumni network where we continue to support, give advice, make introductions, form partnerships, and build together.",
      "<b>4. ILAP APPLICATION PROCESS</b>",
      "The Web3 Startups who want to join our Accelerator Program need to follow the below steps:",
      "<b>Step 01</b>: Fill in the <b>Online Application Form</b>: <a href=\"https://bit.ly/3IV43J0\" target=\"_blank\" rel=\"noreferrer noopener\">https://bit.ly/3IV43J0</a>",
      "<b>Step 02</b>: After being carefully screened and evaluated, the shortlisted candidates will go to the next round - the <b>Interview round</b>.",
      "<b>Step 03</b>: Six successfully selected startups will enjoy ILAP’s mentorship and support during the 8 weeks program. (Selected candidates will be informed one week before the program starts and commit to spending at least 08 hours per week on its activities).",
      "After completing the 08-week program, the qualified Web3 Startups will present and pitch at Showcase Day with 40+ global investors, mentors, experts, and strategic partners!",
      "<b>5. ILAP KEY MILESTONES</b>",
      "Please mark your calendar the following dates:",
      "ILAP Application duration: <b>August 15, 2022 - August 31, 2022</b>",
      "Shortlisted Interview: <b>September 05, 2022</b>",
      "Main Program: <b>September 19, 2022 - November 14, 2022</b>",
      "Demo Day: <b>November</b>",
      "<b>JOIN US NOW TO CO-CREATE LASTING IMPACTS WITH WEB3!</b>"
    ],
    "link": [],
    "tags": ["Accelerator", "Web3"],
    "show": true,
    "highlight": true
  },
  {
    "id": "2",
    "type": "Announcement",
    "title": "Hashed And Icetea Labs Join Forces Towards A Common Goal In GameFi And Metaverse",
    "date": "FRI 02/11",
    "image": "news/hashed.png",
    "hashtags": [],
    "intro": "Hashed and Icetea Labs, as strategic partners, will co-build a self-sustainable, interoperable, open metaverse and GameFi ecosystem in the long run.",
    "content": [
      "Since the latter half of 2021, GameFi and metaverse have driven the crypto market; henceforth, a dozen of crypto games have launched per month and led to a wider selection of games that users can choose from. But as one delves deeper into this space, crypto games are actually facing hardships in implementing a sustainable in-game economy. Simultaneously, even emerging metaverses are extant only on trailers, casting doubt on the wide discrepancy between vision and reality. The market is starting to see faltering games with a short-term focus and an unsustainable in-game economy.",
      "Sharing a common vision and understanding of the potentials for and challenges to the future of GameFi and metaverse, Hashed and Icetea Labs shook hands to form a strategic partnership without termination dates.",
      "To be specific, the two strategic partners will explore the details to cooperate closely in an on-hands manner in GameFi and metaverse with regard to R&D and financing, ranging from infrastructure layers, platforms, and services, to interoperable flagship products, supporting the full lifecycle of games and metaverses (i.e. tokenomics design, launch plan, marketing, and etc.).",
      "The strategic collaboration is expected to fuel the overall growth of the gaming and metaverse industry, especially in the Asia Pacific.",
      "Jun Park, Investment Associate at Hashed focusing on crypto investments through the eyes of gaming: “In reality, the number of crypto games that are officially launched with meaningful daily active users is low. I have noticed faltering projects which were not able to converge their vision and reality at the end of the day. From 2022 along with Icetea Labs, I hope to see and will actively search for genuine GameFi projects with the following, non-exhaustive traits: 1) fair game mechanics; 2) play-to-earn through time-based efforts; 3) circular economy with low treasury intervention; 4) gaming fundamentals being fun at its core.”",
      "Edward Hong, Head of Growth at Hashed: “SEA (Southeast Asia) is the region with the fastest-growing adoption of blockchain games and GameFi. It is mesmerizing that blockchain games like Axie Infinity are now entirely transforming the economic patterns of people living in the region. Through this partnership, Hashed will work closely with Icetea Labs in the region to actively discover founders and support them to create a new value.”",
      "Thi Truong, founder of Icetea Labs: \"Blockchain gaming and metaverse industry suffer if companies just want to take away from it rather than contributing. There are many missing pieces and supporting systems that need to be built seriously and with a long-term vision in mind. In 2022 and the years to come, Icetea Labs devotes itself to research and experiments of sustainable economic models, designing cross-game and cross-metaverse mechanisms, building workforce and inhabitants for metaverses, and collaborating on infrastructure effort. We are very happy to work together with Hashed, one of the most visionary leaders in crypto space, on this journey.\"",
      "Hashed is an early-stage venture firm focused on blockchain protocols. Led by serial entrepreneurs and engineers, Hashed focuses on expediting global blockchain adoption through strategic investments and community building. Based in South Korea, San Francisco, Singapore and Bangalore, Hashed has cultivated industry-defining web3 founders around the globe by accelerating protocols such as Terra Money, Axie Infinity, Klaytn, Link, and The Sandbox. Hashed additionally operates metaverse studio UNOPND and Korean cryptocurrency custodian KODA.",
      "Icetea Labs is a notable gaming and metaverse incubator and enabler in Asia - the world's most exciting blockchain gaming and metaverse community. Operating two of the best performing launchpads, GameFi.org and Red Kite, Icetea Labs has advised, strategically invested, and launched many high profile games and metaverses such as Bloktopia, Sidus, Solice, etc. Icetea Labs also owns Mirai game studio, and is working closely with several industry-leading partners on critical gaming and metaverse initiatives."
    ],
    "link": [],
    "tags": ["Infrastructure", "Partnership"],
    "show": true,
    "highlight": true
  },
  {
    "id": "3",
    "type": "Opinion",
    "title": "Why We Invest: Solice - The first VR metaverse platform on Solana",
    "date": "FRI 02/17",
    "image": "news/solice.png",
    "hashtags": [],
    "intro": "The market is far beyond the gaming or blockchain communities, which can get easily onboarded from regular platforms like smartphones or laptops. Thus, a new metaverse utilizing the cutting edge technology of blockchain and giving the users an immersive experience within virtual reality (VR) is what makes Solice becomes one of the hottest projects recently.",
    "content": [
      "\bWhat is Solice?\b Solice is a VR Metaverse built on the Solana blockchain which is the fastest blockchain by far and is one of the fastest-growing ecosystems in the crypto world. Many platforms are supported in the Solice metaverse, removing the barrier of disparate hardware, software, and operating systems. This allows users to invite more friends and family, increasing the user base's exponential growth potential.",
      "The Solice metaverse is built to provide people as much freedom as possible, much like in real life. By using the Solice native token, users can participate in democratic governance. The governance mechanism will be based on a liquid democracy and real-world inspiration rules and done via a DAO (Decentralized Autonomous Organization).",
      "\bHighlights About Solice\b Solice, created by a core team of senior software engineers and creative designers, with assistance from VR gaming experts and crypto/DeFi veterans, promises to be the most immersive and engaging virtual world in the blockchain world.",
      "One of the most exciting aspects of Solice is the limitless possibilities in its open 3D world: a Metaverse VR where users can play, build, own, exchange, and monetize their virtual experiences in an immersive way on the Solana blockchain.",
      "What makes Solice different from current metaverse projects is the ability to improve the user experience, connecting them through VR and cross-platform technology. Currently, most metaverse projects are only on a single platform which is either on a smartphone or web-based. Solice metaverse is compatible with wearable VR/AR tech out of the box which will make users fully enjoy themselves in the metaverse world.",
      "Besides, the lack of cross-platform functionality is another popular problem. Users are often limited to connecting with other users on the same platform, keeping content and user base centralized. Solice solves this problem by allowing cross-platform options. Whether users are using smartphones, desktop computers, or VR devices, all users can connect to the same metaverse to play, communicate, socialize and even work together.",
      "Moreover, Solice project was backed by leading crypto investors, including Three Arrows Capital, Animoca Brands, and DeFiance Capital alongside strategic backers and partners such as Alameda Research, KuCoin Labs, Icetea Labs, and many more.",
      "\bAbout Icetea Labs\b Icetea Labs is a notable gaming and metaverse incubator and enabler in Asia - the world's most exciting blockchain gaming and metaverse community. With an extensive network of venture capitalists and programmers, Icetea Labs provides four different services to firms that are tailored to their individual needs including Project incubation, Advisory partner, Project launching, and Developer Hub. Icetea Labs is currently working as a strategic consultant for many famous projects, such as GameFi, Red Kite, Faraland, Deathroad, Metawars, Wonder Hero, Dreams Quest, Warena, Mymasterwar, ASPO World, etc.",
      "Follow us on Twitter to keep up with our latest projects and activities.",
      "\bDisclaimer\b The article above is for general informational and educational purposes solely. Although every effort has been made to provide complete and accurate information, certain information contained here has been obtained from third-party sources, Icetea Labs makes no warranties, express or implied, or representations as to the accuracy of the content on this article.",
      "In addition, the material contained in this article speaks only as of the date indicated. Any information, estimates, targets and/or opinions provided within this article are subject to change without notice. Icetea Labs do not have any obligation to provide revised opinions in the event of changed circumstances.",
      "All investment strategies and decisions involve the risk of loss. Nothing contained in the above article or in this website should be interpreted as investment advice."
    ],
    "link": ["https://twitter.com/Icetea_Labs"],
    "tags": ["Metaverse", "Solana", "Investment"],
    "show": true,
    "highlight": false
  },
  {
    "id": "4",
    "type": "Announcement",
    "title": "Icetea Labs Partners with Filecoin for Greater Decentralization and Asset Integrity in Open Metaverse",
    "date": "TUE 03/08",
    "image": "news/filecoin.png",
    "hashtags": [],
    "intro": "We’re pleased to announce Icetea Labs’ partnership with Filecoin, one of the pioneers in decentralized storage networks, to drive the adoption of decentralized data storage for blockchain-based projects, especially in the open metaverse.",
    "content": [
      "As a notable gaming and metaverse incubator and enabler in Asia, Icetea Labs pays particular attention not only to researching, building the workforce and inhabitants of metaverses, but also collaborating on infrastructure efforts.",
      "The collaboration will see Icetea Labs becoming the bridge between Filecoin and future projects within our ecosystem that aim to have a large number of users and content uploaded. Filecoin can be a compelling alternative to traditional web services with the ability to make information and data persist in a secure, private manner. With a decentralized system like Filecoin, there is no risk of data loss once it’s stored. The projects’ files are split up, encrypted, and stored on many computers throughout the world. It helps avoid relying on trusted third parties, or vendors who keep the data hostage. Furthermore, the cost of storing data on Filecoin is remarkably lower than centralized enterprises today.",
      "Through this collaboration, Filecoin will support Web3 games and metaverse projects within IceTea Labs’ network on their storage and infrastructure needs. In addition, projects using IPFS and Filecoin (and services like NFT.storage, Estuary, Web3.storage) for decentralized storage are eligible for a $5,000 grant.  Eligible projects can apply here. Applications are reviewed on a rolling basis.",
      "At the same time, Icetea Labs will work with Filecoin and the Protocol Labs ecosystem fund to invest in and support high-quality open metaverse projects.",
      "Icetea Labs and Filecoin will collaborate to open up more opportunities that benefit projects and development teams in the blockchain space in terms of decentralized data storage, funding, and launchpads. Both parties will explore further collaborations and foster a long-term relationship to support new ideas in the open metaverse and other fields of common interest.",
      "\bAbout Filecoin\b Filecoin, the world’s largest decentralized network, allows users to store, request, and transfer data via a verifiable marketplace. Filecoin is completely open-source, enabling people from all over the world to participate. The Filecoin protocol runs on an advanced and novel proof system — a combination of Proof of Spacetime (PoSt) and Proof of Replication (PoRep), to provide unmatched efficiency and reliability.",
      "Filecoin’s advanced technology provides a robust foundation to store the world’s most valuable data sets. An alternative to costly cloud storage, the Filecoin network offers efficiently priced and geographically decentralized storage, minimizing financial barriers and allowing users to take advantage of its unmatched network capabilities.",
      "\bAbout Icetea Labs\b Icetea Labs is a notable gaming and metaverse incubator and enabler in Asia - the world's most exciting blockchain gaming and metaverse community. With an extensive network of venture capitalists and programmers, Icetea Labs provides four different services to firms that are tailored to their individual needs including Project incubation, Advisory partner, Project launching, and Developer Hub.",
      "Icetea Labs is currently working as a strategic consultant for many famous projects, such as GameFi, Red Kite, Faraland, Deathroad, Metawars, Wonder Hero, Dreams Quest, Warena, Mymasterwar, ASPO World, etc."
    ],
    "link": [],
    "tags": ["Filecoin", "Partnership"],
    "show": true,
    "highlight": false
  }
]
