[
  {
    "id": "1",
    "type": "Announcement",
    "title": "ICETEA LABS ECOSYSTEM - OCTOBER REPORT",
    "date": "Mon 07/11",
    "image": "news/ecosystem_report.jpg",
    "hashtags": [],
    "short_intro": "",
    "intro": "",
    "html": true,
    "content": [
      "<p>Dear readers,</p>",
      "<p>We write this report for our team - to recognize the incredible job our team completed in October and to summarize the Icetea Labs ecosystem milestones for any new users.</p>",
      "<p>We write it for ourselves to organize our monkey mind and create an overview for non-crypto users to get to know the best available index in the Icetea Labs ecosystem.</p>",
      "<p>Most importantly, we are writing to you as well. We make an effort to give our overview to everyone who will benefit from it, whether you&apos;re a crypto beginner or one of our multi-cycle customers.</p>",
      "<p>Let&apos;s dive in</p>",
      "<p>ICETEA LABS ACCELERATOR PROGRAM&nbsp;</p>",
      "<p>An 08-week accelerator program that helps Web3 Startups in building a product-market fit and expanding, and growth. This journey is specially designed for potential startups that already have MVPs for Web3 applications, especially in GameFi, NFT, or Metaverse.</p>",
      "<p><img src=\"news/ecosystem_report_detail_2.jpg\" width=\"100%\"></p>",
      "<ol>",
      "<li>",
      "<p>Events and Updates</p>",
      "</li>",
      "</ol>",
      "<p>Last month, a series of ILAP workshops were organized with experts on specific topics. The first workshop took place with the participants of Joseph Young from Hashed, Boburjon Muydinov (Brian) from Dvision Network, and representatives from Top6. Another workshop was hosted by Hatu - The cofounder of DAO Maker to discuss his perspective on tokenomics.&nbsp;</p>",
      "<p>The special other activity was Tea Talk #1: Tell us your Web3 story, a cozy meeting to allow Top06 Finalists to build deeper bonds with the organizers, workshop mentors, and partners.</p>",
      "<p>One of our newest initiatives IFO - Initial Fan Offering was released to the Icetea Labs community, you would become a true fan of our ecosystem, provide active contributions to its powered/ incubated projects and earn valuable tokens in return.</p>",
      "<ol start=\"2\">",
      "<li>",
      "<p>Ecosystem Partners&nbsp;</p>",
      "</li>",
      "</ol>",
      "<p>In October, ILAP ecosystem partners reached a total of 57 well-known businesses. They are big technology corporations, international venture capitals, and &quot;pedestals&quot; for many successful companies in the market. Some prominent names can be mentioned such as AlphaVentureDAO, Kucoin Labs, Polygon, YGGSea, Avocado Dao, Dvision network, Nodereal, AWS, and so on.</p>",
      "<p><br>On October 7th, 2022, Icetea Labs together with Symbolic Capital, LedgerPrime, Hashed and &nbsp;Polygon Ventures hosted the Private Cocktail Night in Hanoi, Vietnam, with 100+ C-level participants &nbsp; from big names such as Kyber, Houbi, AWS, etc. .</p>",
      "<p>FIREBIRD</p>",
      "<p>A game-dedicated web2-friendly high-performance blockchain.</p>",
      "<p><img src=\"news/ecosystem_report_detail_3.jpg\" width=\"100%\"></p>",
      "<ol>",
      "<li>",
      "<p>Events and Updates</p>",
      "</li>",
      "</ol>",
      "<p>PolkaFoundry Rebrands as Firebird - Cosmos-based game-dedicated L1 blockchain with an emphasis on UX-enabling features to eliminate web3 barriers for web2 users.</p>",
      "<p>Icetea Labs, Parent Corporation to Firebird (formerly known as PolkaFoundry), commenced building the Layer-1 blockchain more than 3 years ago. Despite struggling time finding a niche in the market in the first place, with the possession of several blockchain&rsquo;s valuable ideas, Icetea Labs has transformed into top Web3 gaming and metaverse incubator in SEA that is also operating&nbsp;<a href=\"http://gamefi.org/\">GameFi.org</a>,&nbsp;<a href=\"https://redkite.polkafoundry.com/#/\">Red Kite launchpad</a>,&nbsp;<a href=\"https://ilap.icetea.io/\">ILAP</a>,&nbsp;<a href=\"https://www.desports.gg/\">DESports</a>,&nbsp;<a href=\"https://metaforce.org/\">Metaforce</a>, etc.</p>",
      "<p>Firebird released the Testnet campaign from October 16th to November 3rd, and the Mainnet is projected to be released in December 2022.</p>",
      "<p>The first task of Firebird after completing rebranding: Firebird has onboarded &nbsp;exclusive partners deploying for this campaign, including &nbsp;F2Game, Gunstar, Wanaka Farm, Evermoon, My Master War, and Monsterra.&nbsp;</p>",
      "<p>The governance token ($PKF) remains unchanged and plays an increasingly vital role in Firebird&rsquo;s ecosystem, this aims to increase the chance the token price can corner the market and can increase gross volume and revenue stream. .&nbsp;</p>",
      "<ol start=\"2\">",
      "<li>",
      "<p>Community</p>",
      "</li>",
      "</ol>",
      "<p>Firebird network successfully organized a quiz game that attracted more than 10k users joining. The event was successfully concluded on October 14th, 2022.&nbsp;</p>",
      "<p>GAMEFI.ORG&nbsp;</p>",
      "<p>An all-in-one discovery hub for web3 games and metaverses.</p>",
      "<p><img src=\"news/ecosystem_report_detail_4.jpg\" width=\"100%\"></p>",
      "<ol>",
      "<li>",
      "<p>Events and Updates</p>",
      "</li>",
      "</ol>",
      "<p>Let&rsquo;s start with the breakout event of GameFi this year:&nbsp;Catventure</p>",
      "<p>Gamefi successfully organized of Birthday Event. This very first web3 gaming event aims to boost branding awareness and acquire new users for games and projects and brings players a captivating, thrilling, and diverse experience of multiple gameplays.</p>",
      "<p>The event has reached more than&nbsp;6.5 million impressions&nbsp;and followers across platforms and more than&nbsp;12k real players&nbsp;are immersed in the appealing gameplay with more than&nbsp;100 partners.&nbsp;GameFi.org poured more than&nbsp;$70,000&nbsp;into this event. The top&nbsp;500 players&nbsp;with the highest Gafish were rewarded with a precious prize.&nbsp;</p>",
      "<ol start=\"2\">",
      "<li>",
      "<p>Partners and Community updates:&nbsp;</p>",
      "</li>",
      "</ol>",
      "<p>At present,&nbsp;GameFi.org&nbsp;has established contact with&nbsp;Dvision Network&nbsp;and has officially launched&nbsp;Land Box Sale.&nbsp;GameFi.org&nbsp;also formed Strategic Partner with&nbsp;ILAP&nbsp;and was the first initiative to step into&nbsp;IFO (Initial Fan Offering)&nbsp;of Icetea Labs Accelerator Program.&nbsp;</p>",
      "<p><a href=\"http://gamefi.org/\">GameFi.org</a> team expands the topics to be discussed in the group. Not only<a href=\"http://gamefi.org/\">&nbsp;GameFi.org</a> issues or projects launched on<a href=\"http://gamefi.org/\">&nbsp;GameFi.org</a> but users can discuss all blockchain game projects, fun talks, trade talks, photos, memes, and related topics in the Telegram Chat group.</p>",
      "<p><a href=\"http://gamefi.org/\">GameFi.org</a> Insight is to be released to update the latest news about crypto, games, and the metaverse. Users can access, read, share, and discuss in the Telegram Chat group.</p>",
      "<ol start=\"3\">",
      "<li>",
      "<p>Technical progress</p>",
      "</li>",
      "</ol>",
      "<p><img src=\"news/gamefi_report.jpg\" width=\"100%\"></p>",
      "<p>DappRadar estimated an NFT market cap of $14 billion in early September, a number that has risen since. Given the design space that NFTs have opened up for the entire crypto user economy, the long-term size and scope of this segment are scary big. We&rsquo;ll see 10% of crypto ($225B today) in the NFT market cap. We don&rsquo;t think they are off, but that may speak more to the opportunity for NFT creators and infrastructure builders than it does to the inevitability of most specific NFT projects.</p>",
      "<p>The &ldquo;real world&rdquo; version of an NFT might be something like the deed to your house (verifiably scarce) or you could grant access to the house for Airbnb guests with the NFT (programmable), or you could take out a home equity line of credit and pledge the NFT as collateral on a peer-to-peer lending platform (portable).</p>",
      "<p>That comes later. The&nbsp;GameFi NFT&nbsp;was released in late October.&nbsp;</p>",
      "<p>RED KITE</p>",
      "<p>A cutting-edge launchpad and some DeFi/NFTFi features.</p>",
      "<p><img src=\"news/ecosystem_report_detail_6.jpg\" width=\"100%\"></p>",
      "<p>Red Kite&nbsp;using the same token as Firebird is a launchpad and NFTFI suite. The team has launched new staking pools for $PKF. The staking requirements and mechanisms are the same for the old and new staking pools, but the APR is different. The reason for this change is our platform will undergo a substantial update next month, promising potential and providing additional utilities for $PKF. As a result, the team decided to change APR values to align with the project&rsquo;s development path and improve the user experience.</p>",
      "<p>In light of the present market downturn, RedKite will establish new strategies to develop the project over the long term. Red Kite will concentrate on research, evaluation, and appraisal to identify in-depth, high-value, and profitable projects for the community rather than launching numerous projects. Although the number of IDO projects is likely to decrease during this period, they are working to improve our products and services for the greatest user experience. This month, Red Kite conducted 2 IDOs (MetaBeat &amp; PUMLx), 2 AMAs, 2 giveaway events</p>",
      "<p>DESPORTS</p>",
      "<p>DESports is a Decentralized eSports platform that will elevate the gaming scene for traditional gamers to a whole new level - Web3 Gaming. It is backed by Icetea Labs and 500 Bros Media, leading eSports organizers of Southeast Asia.</p>",
      "<p><img src=\"news/ecosystem_report_detail.jpg\" width=\"100%\"></p>",
      "<ol>",
      "<li>",
      "<p>Events and Updates</p>",
      "</li>",
      "</ol>",
      "<p>This month, Desports has kicked off the series of Desports Open Cup. Only two tournaments in the PUBG Open Cup series, have attracted more than 100 PUBG semi-pro teams in Vietnam. More remarkably, over 1400+ participants joined the appreciation event after Desports PUBG SEA Invitational.&nbsp;</p>",
      "<ol start=\"2\">",
      "<li>",
      "<p>Ecosystem Partners&nbsp;</p>",
      "</li>",
      "</ol>",
      "<p>DESports became an official partner of ILAP and provided special exclusive packages for Web3 Startups joining the program. A grant on DESports&apos; service package (Media, Livestream, PR) is offered to the top 30 projects in ILAP - Autumn 2022 Cohort with the details as below:</p>",
      "<p>💥 Top 06: USD 3.000 Grants&nbsp;</p>",
      "<p>💥 Top 15: USD 2.000 Grants&nbsp;</p>",
      "<p>💥 Top 30: USD 1.500 Grants</p>",
      "<p>Significantly, the top 06 selected projects in ILAP will receive exceptional cross-marketing support (Partnership activities, Early access to referral programs, and Desports fund), have the chance to appear in the list of NFT games introduced by DESports, and free deploy games on DESports Ladder &amp; Tournament.&nbsp;</p>",
      "<ol start=\"3\">",
      "<li>",
      "<p>Technical progress</p>",
      "</li>",
      "</ol>",
      "<p>On October 9, Desports.gg officially debuted Ladder as a new feature and expanded the website&apos;s support for two additional languages (Vietnamese &amp; Thai). Besides, Ladder is also completed and launched.&nbsp;</p>",
      "<p>METAFORCE</p>",
      "<p>Metaforce is the first Web3 gaming on-demand, the work-to-earn protocol that exists to build a symbiotic relationship between players, games, and clans in the ecosystem.&nbsp;</p>",
      "<p><img src=\"news/ecosystem_report_detail_5.jpg\" width=\"100%\"></p>",
      "<ol>",
      "<li>",
      "<p>Events and Updates</p>",
      "</li>",
      "</ol>",
      "<p>Metaforce officially launched Alpha Release on October 17th for exclusive partners with amazing new features.</p>",
      "<p><img src=\"news/ecosystem_report_event.png\" width=\"100%\"></p>",
      "<ol start=\"2\">",
      "<li>",
      "<p>Ecosystem Partners&nbsp;</p>",
      "</li>",
      "</ol>",
      "<p>In October, Metaforce welcomed Icetea Labs as the first lead backer. Icetea Labs has a tremendously experienced team with a litany of high-level roles throughout various first-tier companies. With the vast experience that Icetea Labs possesses, the support Metaforce can receive will be extremely helpful in focusing on developing its products. Icetea Labs will assist Metaforce in partnership development, tokenomics advisory, project marketing, and community expansion.&nbsp;</p>",
      "<ol start=\"3\">",
      "<li>",
      "<p>Technical progress</p>",
      "</li>",
      "</ol>",
      "<p>💥Development version update: Metaforce Tasks</p>",
      "<p>💥Functional development: Multi-tenant Leaderboard</p>",
      "<p>💥Performance optimization: Content Platform</p>",
      "<p>💥Bugs fixed: Cross-marketing and Community-monitoring</p>",
      "<p>CONCLUSION</p>",
      "<p>October was an extremely volatile month for the market but also an active month for us. In the context that investment activities and cash flow are becoming scarce, we remain focused on building and developing our ecosystem with notable milestones such as the launch of Metaforce information, the implementation of events on DESports, or, more notably, the birthday event of GameFi.org with impressive numbers.</p>",
      "<p>November will be Icetea Labs&apos; birthday month, and hopefully, we&apos;ll celebrate it with even more remarkable achievements.</p>"
    ],
    "link": [],
    "tags": ["IceteaLab", "Ecosystem"],
    "show": true,
    "highlight": false
  },
  {
    "id": "2",
    "type": "Announcement",
    "title": "Startup Story: 15 minutes with Julio Kosta - the Founder of Victory Point",
    "date": "Wed 26/10",
    "image": "news/julio_kotas_speak.png",
    "hashtags": [],
    "short_intro": "",
    "intro": "",
    "html": true,
    "content": [
      "<p><iframe style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/episode/49scVDCchpa6tt9e7otl3o?utm_source=generator&theme=0\" width=\"100%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></p>",
      "<p>Victory Point currently has a strong user base with a high percentage of hard-core fans. Sharing about the achievement of a well-built community, Julio Kosta - the Co-Founder and CEO of Victory Point said that “We have a quick and short marketing campaign, priority on discord, from there we start growing our Twitter account and Telegram account, right now we have over 40,000 members across them”, “5,000 of them are more active and 1,000 to 2,000 of them are hard-core fans of Victory Point”.</p>",
      "<p>Julio Kosta is proud to have a team with significant experience in the FPS field. Besides, a strength of Victory Point has a healthy and balanced economy designed in the game - which is the key to remain sustainable and long-run development of the project. He understands that in Web2, the gameplay is the key, but in Web3, gameplay and game economy are equally crucial.</p>",
      "<p>About the Icetea Labs Accelerator Program, Julio Kosta chose to join this cohort because of the reputation and the good name of Icetea Labs in this market. “We find some of the largest Web3 participants in ILAP such as Hashed, Protocol Labs, Saison Capital, Spark Capital, etc”. He also hopes to meet other Web3 builders on Demo Day at Miracle Block 2022 as he thinks they all have the same objective to bring the adoption to Web3, especially in Web3 gaming.</p>",
      "<p>Check the audio to know more interesting things about Victory Point - the top 06 projects in ILAP.</p>",
      "<p>Also, don’t miss the next episode of Startup Story: 15 minutes with ILAP top projects. See you next week!</p>",
      "<p>Follow&nbsp;<a href=\"https://twitter.com/Icetea_Labs\">Icetea Labs Twitter</a> and our&nbsp;<a href=\"https://t.me/ILAP_Announcement\">Telegram official channel</a> to get the latest updates!</p>"
    ],
    "link": [],
    "tags": ["Accelerator", "Web3"],
    "show": true,
    "highlight": false
  },
  {
    "id": "3",
    "type": "Announcement",
    "title": "Introducing the Icetea Labs accelerator program",
    "date": "Mon 15/08",
    "image": "https://i.imgur.com/SxRkvor.png",
    "hashtags": [],
    "short_intro": "Web3 leading incubator Icetea Labs has announced the creation of its inaugural Web3 Accelerator Program in conjunction with Polygon and Alpha Venture DAO.",
    "intro": "INTRODUCING THE ICETEA LABS ACCELERATOR PROGRAM",
    "html": true,
    "content": [
      "<p><b>1. WHAT IS THE ICETEA LABS ACCELERATOR PROGRAM?</b></p>",
      "<p><b>Icetea Labs Accelerator Program (ILAP)</b> is the 08-week accelerator program that helps Web3 Startups in product/market fit, expansion, and growth. Our focus for this cohort is GameFi, Metaverse, NFT utilities and beyond.</p>",
      "<p>ILAP is powered by Icetea Labs and co-organized with <a href=\"https://polygon.technology/\" style=\"color: white\" target=\"_blank\" rel=\"noreferrer noopener\">Polygon</a>, one of the top blockchain development platforms offering scalable and sustainable blockchains and Alpha Venture DAO, the leading Web3 venture builder and incubator in Southeast Asia.</p>",
      "<p>The Icetea Labs Accelerator Program has the participation of several high-profile partners, funds and mentors including Polygon, <a style=\"color: white\" href=\"https://alphaventuredao.io/\" target=\"_blank\" rel=\"noreferrer noopener\">Alpha Venture DAO</a>, Hashed, Protocol Labs, Global Founders Capital (GFC), Polygon Studios, Saison Capital, Crypto.com Capital, Shima Capital, CyberAgent Capital, Filecoin, Amazon Web Services (AWS), Bybit, GameFi.org, DAO Maker, Avocado DAO, Salad Ventures, Funtap, Red Kite launchpad, Certik, DESports.gg, Symbolic Capital, Spark Digital Capital, Moonrock Capital, iCandy Interactive, Topebox, Dvision Network, BitKeep, Alpha Lab Capital and many others.</p>",
      "<p>The program is also accompanied by several well-known media partners including CoinMarketCap, Momentum6, Crypto Banter, AltcoinBuzz, Cryptodiffer, Satoshi Club, Top 7 ICO, Vendetta Ventures, and HG Ventures.</p>",
      "<p><b>2. WHO SHOULD JOIN ILAP?</b></p>",
      "<p>ILAP is open for any Web3 Startup whose product or service relates to gaming, metaverse, or NFT utilities. Startups at all stages benefit from the contents of ILAP. Early product startups with MVP will benefit the most that we can help with project audit, ecosystem network, security, business model, and go-to-market strategy. While the later stages project will enjoy advice mostly on marketing, community building, traction growth, funding, and tokenomics.</p>",
      "<p>It doesn’t matter where you come from. What world you’re building that counts.</p>",
      "<p><b>3. BENEFITS FOR WEB3 STARTUPS JOINING ILAP</b></p>",
      "<div class=\"image\"><img width=\"800px\" alt=\"\" src=\"https://i.imgur.com/iFY6iE6.png\"/></div>",
      "<p>Web3 Startups who are selected to join the Accelerator program will receive a lot of attractive benefits:</p>",
      "<p><b><u>- Expertise</u></b>: Accessible to in-depth knowledge, mentors, experts, and global investors in Web3 Business.</p>",
      "<p><b><u>- Ecosystem</u></b>: Accessible to an entire ecosystem of Icetea Labs and its partners that supports a full product development and operation lifecycle.</p>",
      "<p><b><u>- Investment</u></b>: Funding opportunities on showcase day where participating startups pitch to accredited venture capital investors, angels, entrepreneurs, mentors, and partners.</p>",
      "<p>The advantage is not limited to the program course only. Graduated startups will have access to Icetea Lab’s Alumni network where we continue to support, give advice, make introductions, form partnerships, and build together.</p>",
      "<p><b>4. ILAP APPLICATION PROCESS</b></p>",
      "<p>The Web3 Startups who want to join our Accelerator Program need to follow the below steps:</p>",
      "<p><b>Step 01</b>: Fill in the <b>Online Application Form</b>: <a href=\"https://bit.ly/3IV43J0\" style=\"color: white\" target=\"_blank\" rel=\"noreferrer noopener\">https://bit.ly/3IV43J0</a></p>",
      "<p><b>Step 02</b>: After being carefully screened and evaluated, the shortlisted candidates will go to the next round - the <b>Interview round</b>.</p>",
      "<p><b>Step 03</b>: Successfully selected startups will enjoy ILAP’s mentorship and support during the 8 weeks program. (Selected candidates will be informed one week before the program starts and commit to spending at least 08 hours per week on its activities).</p>",
      "<p>After completing the 08-week program, the qualified Web3 Startups will present and pitch at Showcase Day with 40+ global investors, mentors, experts, and strategic partners!</p>",
      "<p><b>5. ILAP KEY MILESTONES</b></p>",
      "<div class=\"image\"><img width=\"800px\" alt=\"\" src=\"https://i.imgur.com/MisXvHD.png\"/></div>",
      "<p>Please mark your calendar the following dates:</p>",
      "<p>ILAP Application duration: <b>August 15, 2022 - August 31, 2022</b></p>",
      "<p>Shortlisted Interview: <b>September 01, 2022</b></p>",
      "<p>Main Program: <b>September 26, 2022 - November 21, 2022</b></p>",
      "<p>Demo Day: <b>November</b></p>",
      "<p><b>JOIN US NOW TO CO-CREATE LASTING IMPACTS WITH WEB3!</b></p>"
    ],
    "link": [],
    "tags": ["Accelerator", "Web3"],
    "show": true,
    "highlight": false
  },
  {
    "id": "4",
    "type": "Announcement",
    "title": "Hashed And Icetea Labs Join Forces Towards A Common Goal In GameFi And Metaverse",
    "date": "FRI 02/11",
    "image": "news/hashed.png",
    "hashtags": [],
    "intro": "Hashed and Icetea Labs, as strategic partners, will co-build a self-sustainable, interoperable, open metaverse and GameFi ecosystem in the long run.",
    "content": [
      "Since the latter half of 2021, GameFi and metaverse have driven the crypto market; henceforth, a dozen of crypto games have launched per month and led to a wider selection of games that users can choose from. But as one delves deeper into this space, crypto games are actually facing hardships in implementing a sustainable in-game economy. Simultaneously, even emerging metaverses are extant only on trailers, casting doubt on the wide discrepancy between vision and reality. The market is starting to see faltering games with a short-term focus and an unsustainable in-game economy.",
      "Sharing a common vision and understanding of the potentials for and challenges to the future of GameFi and metaverse, Hashed and Icetea Labs shook hands to form a strategic partnership without termination dates.",
      "To be specific, the two strategic partners will explore the details to cooperate closely in an on-hands manner in GameFi and metaverse with regard to R&D and financing, ranging from infrastructure layers, platforms, and services, to interoperable flagship products, supporting the full lifecycle of games and metaverses (i.e. tokenomics design, launch plan, marketing, and etc.).",
      "The strategic collaboration is expected to fuel the overall growth of the gaming and metaverse industry, especially in the Asia Pacific.",
      "Jun Park, Investment Associate at Hashed focusing on crypto investments through the eyes of gaming: “In reality, the number of crypto games that are officially launched with meaningful daily active users is low. I have noticed faltering projects which were not able to converge their vision and reality at the end of the day. From 2022 along with Icetea Labs, I hope to see and will actively search for genuine GameFi projects with the following, non-exhaustive traits: 1) fair game mechanics; 2) play-to-earn through time-based efforts; 3) circular economy with low treasury intervention; 4) gaming fundamentals being fun at its core.”",
      "Edward Hong, Head of Growth at Hashed: “SEA (Southeast Asia) is the region with the fastest-growing adoption of blockchain games and GameFi. It is mesmerizing that blockchain games like Axie Infinity are now entirely transforming the economic patterns of people living in the region. Through this partnership, Hashed will work closely with Icetea Labs in the region to actively discover founders and support them to create a new value.”",
      "Thi Truong, founder of Icetea Labs: \"Blockchain gaming and metaverse industry suffer if companies just want to take away from it rather than contributing. There are many missing pieces and supporting systems that need to be built seriously and with a long-term vision in mind. In 2022 and the years to come, Icetea Labs devotes itself to research and experiments of sustainable economic models, designing cross-game and cross-metaverse mechanisms, building workforce and inhabitants for metaverses, and collaborating on infrastructure effort. We are very happy to work together with Hashed, one of the most visionary leaders in crypto space, on this journey.\"",
      "Hashed is an early-stage venture firm focused on blockchain protocols. Led by serial entrepreneurs and engineers, Hashed focuses on expediting global blockchain adoption through strategic investments and community building. Based in South Korea, San Francisco, Singapore and Bangalore, Hashed has cultivated industry-defining web3 founders around the globe by accelerating protocols such as Terra Money, Axie Infinity, Klaytn, Link, and The Sandbox. Hashed additionally operates metaverse studio UNOPND and Korean cryptocurrency custodian KODA.",
      "Icetea Labs is a notable gaming and metaverse incubator and enabler in Asia - the world's most exciting blockchain gaming and metaverse community. Operating two of the best performing launchpads, GameFi.org and Red Kite, Icetea Labs has advised, strategically invested, and launched many high profile games and metaverses such as Bloktopia, Sidus, Solice, etc. Icetea Labs also owns Mirai game studio, and is working closely with several industry-leading partners on critical gaming and metaverse initiatives."
    ],
    "link": [],
    "tags": ["Infrastructure", "Partnership"],
    "show": true,
    "highlight": false
  },
  {
    "id": "5",
    "type": "Opinion",
    "title": "Why We Invest: Solice - The first VR metaverse platform on Solana",
    "date": "FRI 02/17",
    "image": "news/solice.png",
    "hashtags": [],
    "intro": "The market is far beyond the gaming or blockchain communities, which can get easily onboarded from regular platforms like smartphones or laptops. Thus, a new metaverse utilizing the cutting edge technology of blockchain and giving the users an immersive experience within virtual reality (VR) is what makes Solice becomes one of the hottest projects recently.",
    "content": [
      "\bWhat is Solice?\b Solice is a VR Metaverse built on the Solana blockchain which is the fastest blockchain by far and is one of the fastest-growing ecosystems in the crypto world. Many platforms are supported in the Solice metaverse, removing the barrier of disparate hardware, software, and operating systems. This allows users to invite more friends and family, increasing the user base's exponential growth potential.",
      "The Solice metaverse is built to provide people as much freedom as possible, much like in real life. By using the Solice native token, users can participate in democratic governance. The governance mechanism will be based on a liquid democracy and real-world inspiration rules and done via a DAO (Decentralized Autonomous Organization).",
      "\bHighlights About Solice\b Solice, created by a core team of senior software engineers and creative designers, with assistance from VR gaming experts and crypto/DeFi veterans, promises to be the most immersive and engaging virtual world in the blockchain world.",
      "One of the most exciting aspects of Solice is the limitless possibilities in its open 3D world: a Metaverse VR where users can play, build, own, exchange, and monetize their virtual experiences in an immersive way on the Solana blockchain.",
      "What makes Solice different from current metaverse projects is the ability to improve the user experience, connecting them through VR and cross-platform technology. Currently, most metaverse projects are only on a single platform which is either on a smartphone or web-based. Solice metaverse is compatible with wearable VR/AR tech out of the box which will make users fully enjoy themselves in the metaverse world.",
      "Besides, the lack of cross-platform functionality is another popular problem. Users are often limited to connecting with other users on the same platform, keeping content and user base centralized. Solice solves this problem by allowing cross-platform options. Whether users are using smartphones, desktop computers, or VR devices, all users can connect to the same metaverse to play, communicate, socialize and even work together.",
      "Moreover, Solice project was backed by leading crypto investors, including Three Arrows Capital, Animoca Brands, and DeFiance Capital alongside strategic backers and partners such as Alameda Research, KuCoin Labs, Icetea Labs, and many more.",
      "\bAbout Icetea Labs\b Icetea Labs is a notable gaming and metaverse incubator and enabler in Asia - the world's most exciting blockchain gaming and metaverse community. With an extensive network of venture capitalists and programmers, Icetea Labs provides four different services to firms that are tailored to their individual needs including Project incubation, Advisory partner, Project launching, and Developer Hub. Icetea Labs is currently working as a strategic consultant for many famous projects, such as GameFi, Red Kite, Faraland, Deathroad, Metawars, Wonder Hero, Dreams Quest, Warena, Mymasterwar, ASPO World, etc.",
      "Follow us on Twitter to keep up with our latest projects and activities.",
      "\bDisclaimer\b The article above is for general informational and educational purposes solely. Although every effort has been made to provide complete and accurate information, certain information contained here has been obtained from third-party sources, Icetea Labs makes no warranties, express or implied, or representations as to the accuracy of the content on this article.",
      "In addition, the material contained in this article speaks only as of the date indicated. Any information, estimates, targets and/or opinions provided within this article are subject to change without notice. Icetea Labs do not have any obligation to provide revised opinions in the event of changed circumstances.",
      "All investment strategies and decisions involve the risk of loss. Nothing contained in the above article or in this website should be interpreted as investment advice."
    ],
    "link": ["https://twitter.com/Icetea_Labs"],
    "tags": ["Metaverse", "Solana", "Investment"],
    "show": true,
    "highlight": false
  },
  {
    "id": "6",
    "type": "Announcement",
    "title": "Icetea Labs Partners with Filecoin for Greater Decentralization and Asset Integrity in Open Metaverse",
    "date": "TUE 03/08",
    "image": "news/filecoin.png",
    "hashtags": [],
    "intro": "We’re pleased to announce Icetea Labs’ partnership with Filecoin, one of the pioneers in decentralized storage networks, to drive the adoption of decentralized data storage for blockchain-based projects, especially in the open metaverse.",
    "content": [
      "As a notable gaming and metaverse incubator and enabler in Asia, Icetea Labs pays particular attention not only to researching, building the workforce and inhabitants of metaverses, but also collaborating on infrastructure efforts.",
      "The collaboration will see Icetea Labs becoming the bridge between Filecoin and future projects within our ecosystem that aim to have a large number of users and content uploaded. Filecoin can be a compelling alternative to traditional web services with the ability to make information and data persist in a secure, private manner. With a decentralized system like Filecoin, there is no risk of data loss once it’s stored. The projects’ files are split up, encrypted, and stored on many computers throughout the world. It helps avoid relying on trusted third parties, or vendors who keep the data hostage. Furthermore, the cost of storing data on Filecoin is remarkably lower than centralized enterprises today.",
      "Through this collaboration, Filecoin will support Web3 games and metaverse projects within IceTea Labs’ network on their storage and infrastructure needs. In addition, projects using IPFS and Filecoin (and services like NFT.storage, Estuary, Web3.storage) for decentralized storage are eligible for a $5,000 grant.  Eligible projects can apply here. Applications are reviewed on a rolling basis.",
      "At the same time, Icetea Labs will work with Filecoin and the Protocol Labs ecosystem fund to invest in and support high-quality open metaverse projects.",
      "Icetea Labs and Filecoin will collaborate to open up more opportunities that benefit projects and development teams in the blockchain space in terms of decentralized data storage, funding, and launchpads. Both parties will explore further collaborations and foster a long-term relationship to support new ideas in the open metaverse and other fields of common interest.",
      "\bAbout Filecoin\b Filecoin, the world’s largest decentralized network, allows users to store, request, and transfer data via a verifiable marketplace. Filecoin is completely open-source, enabling people from all over the world to participate. The Filecoin protocol runs on an advanced and novel proof system — a combination of Proof of Spacetime (PoSt) and Proof of Replication (PoRep), to provide unmatched efficiency and reliability.",
      "Filecoin’s advanced technology provides a robust foundation to store the world’s most valuable data sets. An alternative to costly cloud storage, the Filecoin network offers efficiently priced and geographically decentralized storage, minimizing financial barriers and allowing users to take advantage of its unmatched network capabilities.",
      "\bAbout Icetea Labs\b Icetea Labs is a notable gaming and metaverse incubator and enabler in Asia - the world's most exciting blockchain gaming and metaverse community. With an extensive network of venture capitalists and programmers, Icetea Labs provides four different services to firms that are tailored to their individual needs including Project incubation, Advisory partner, Project launching, and Developer Hub.",
      "Icetea Labs is currently working as a strategic consultant for many famous projects, such as GameFi, Red Kite, Faraland, Deathroad, Metawars, Wonder Hero, Dreams Quest, Warena, Mymasterwar, ASPO World, etc."
    ],
    "link": [],
    "tags": ["Filecoin", "Partnership"],
    "show": true,
    "highlight": false
  },
  {
    "id": "7",
    "type": "Announcement",
    "title": "INTRODUCING 06 FINALISTS IN ILAP - AUTUMN 2022 COHORT",
    "date": "Fri 23/09",
    "image": "https://i.imgur.com/f0G78Mj.png",
    "hashtags": [],
    "short_intro": "Icetea Labs Accelerator Program (ILAP - Autumn 2022 Cohort) is organized to support Web3 Startups and move Web3 forward. Together meet our top 06 Startups chosen from 250+ applications!",
    "intro": "INTRODUCING 06 FINALISTS IN ILAP - AUTUMN 2022 COHORT",
    "html": true,
    "content": [
      "<p><b>Icetea Labs Accelerator Program (ILAP - Autumn 2022 Cohort)</b> is organized to support Web3 Startups and move Web3 forward together. 06 finalists chosen from 250+ applications will join us in the 08-week accelerator program.</p>",
      "<p>Through the intensive 08-week bootcamp, our Head Mentors will closely accompany the projects. Many activities are exclusively organized for the top finalists: intensive workshops with specific topics for learning from experts, Tea Talk with our Partners and Mentors to build strong networking, Mentoring 1on1 with Head Mentors, etc. Significantly, the Demo Day will be specially organized on the biggest event of IceTea Labs this November - the Miracle event.</p>",
      "<p>We are thrilled to share details of the 06 Startups joining ILAP - Autumn 2022 Cohort. Together meet our top 06 Startups:</p>",

      "<p><br /></p>",
      "<p><b>VICTORY POINT</b></p>",
      "<div class=\"image\"><img width=\"800px\" alt=\"\" src=\"https://i.imgur.com/3HYO1uW.png\"/></div>",
      "<p><b>Victory Point</b> is an AAA-rated, Free-to-Play (F2P), Play-to-Earn (P2E), Multiplayer, First Person Shooter (FPS) game built on Unreal Engine and powered by blockchain and NFTs. Victory Point is the first game to adopt a zero-sum-game reward system with the focus on retaining a long-term, healthy and sustainable economy within its ecosystem. The game was initially intended to release only on PC via Steam and Epic Games as a web2 game (previously titled Hind Warfare).</p>",
      "<p><b>Victory Point website:</b> <a class=\"link-ref\" href=\"https://victorypoint.io/\">https://victorypoint.io/</a></p>",

      "<p><br /></p>",
      "<p><b>TOONFT</b></p>",
      "<div class=\"image\"><img width=\"800px\" alt=\"\" src=\"https://i.imgur.com/h9658n8.png\"/></div>",
      "<p><b>TooNFT</b> is an unprecedented blockchain-based platform that will revolutionize the WebToon industry by creating an innovative, next-generation NFT ecosystem. TooNFT strives to establish a decentralized WebToon market through implementing a transparent compensation system based on blockchain technology. Through the utilization of cutting-edge technological advancements like smart contracts and NFTs, the TooNFT team discovered an opportunity to eliminate the role of middlemen and create a transformed decentralized WebToon ecosystem with features such as transparency, fairness, and a focus on creators and consumers.</p>",
      "<p><b>TooNFT website:</b> <a class=\"link-ref\" href=\"https://toonft.com/\">https://toonft.com/</a></p>",

      "<p><br /></p>",
      "<p><b>YOOLDO | TROUBLE PUNK</b></p>",
      "<div class=\"image\"><img width=\"800px\" alt=\"\" src=\"https://i.imgur.com/bah7ra0.png\"/></div>",
      "<p><b>Yooldo</b> is an X-to-Earn game content platform which will have tokenomics optimized for the content provided by each game, and which the form of Earn also vary from game to game.</p>",
      "<p><b>Trouble Punk | Cyber Galz</b>, the first game on the Yooldo platform, is a fighting action game of the battle royale genre. Users can collect points dropped in the game to win in a limited time. Users need to beat off as many opponents as possible while trying to earn as many points as they can. They used the Unity engine for the development, they adopted a client execution method rather than a web app-based method for in-game functions and controls. Trouble Punk will be released for PC upon the launch, and the mobile version is being considered to be available later.</p>",
      "<p><b>Yooldo website:</b> <a class=\"link-ref\" href=\"https://www.yooldo.gg/\">https://www.yooldo.gg/</a></p>",
      "<p><b>Trouble Punk | Cyber Galz website:</b> <a class=\"link-ref\" href=\"https://troublepunk.com/web3/\">https://troublepunk.com/web3/</a></p>",

      "<p><br /></p>",
      "<p><b>GUMMYS</b></p>",
      "<div class=\"image\"><img width=\"800px\" alt=\"\" src=\"https://i.imgur.com/QUOQlPO.png\"/></div>",
      "<p><b>Gummys</b> is a new income opportunity for content creators and users. Create, own, earn is our paradigm. Users can earn by making content, minting videos as NFT, watching videos, engaging with content creators, and more actions. Through Gummys privacy measures, users have peace of mind knowing that they do not need to worry about their data being sold to third parties or a data bridge as they only need a blockchain public address to use the platform. Gummys will use the grant for the development of key features of the platform like storing video metadata on the blockchain making the platform censorship-resistant and minting video as NFT.</p>",
      "<p><b>Gummies website:</b> <a class=\"link-ref\" href=\"https://www.gummys.io/\">https://www.gummys.io/</a></p>",

      "<p><br /></p>",
      "<p><b>HASHBON PASS</b></p>",
      "<div class=\"image\"><img width=\"800px\" alt=\"\" src=\"https://i.imgur.com/yB3uP7r.png\"/></div>",
      "<p><b>Hashbon Pass</b> NFT Passport, or by Hashbon FiRe is an NFT and a decentralized protocol for reusable identity verification on blockchains such as Ethereum, BNB Chain, Polygon, and other EVM-compatible networks. Their protocol involves the participation of three parties: Verifiers, Users, DeFi protocols that require user identification</p>",
      "<p><b>Hashbon Pass website:</b> <a class=\"link-ref\" href=\"https://pass.hashbon.com/\">https://pass.hashbon.com/</a></p>",

      "<p><br /></p>",
      "<p><b>ETERNAL GLORY</b></p>",
      "<div class=\"image\"><img width=\"800px\" alt=\"\" src=\"https://i.imgur.com/KbkPryb.png\"/></div>",
      "<p><b>Eternal Glory</b> is a Multichain GameFi platform with distinguished reward balance mechanism and economic system to ensure a fair environment. It is backed by IEC - one of the Top 7 Game Studio in South East Asia, with 600M+ downloads Worldwide. Eternal Glory is a multiverse that is made up of many realms. Each realm in Eternal Glory is designed to have unique gameplay mechanics and each NFT is designed to have different skill sets and different use cases once they set foot into a new realm. Players can endlessly travel between different realms, uncover hidden treasure, unlock new game modes to achieve ultimate glory.</p>",
      "<p><b>Eternal Glory website:</b> <a class=\"link-ref\" href=\"https://eternalglory.io/\">https://eternalglory.io/</a></p>",

      "<p>Our mission is to try our best to support the Web3 Startups, especially Web3 Startups joining ILAP, scale and thrive through our ecosystems, networking, and deep experience in this industry. The ILAP kick-off event successfully took place at <b>10:00 UTC on September 23</b> with the participation of the representatives of top 06 finalists, trio organizers, mentors, and our partners, marking a good inauguration.</p>",
      "<p><b>Let’s co-create lasting impact with Web3 together!</b></p>"
    ],
    "link": [],
    "tags": ["Accelerator", "Web3"],
    "show": true,
    "highlight": true
  }
]
